Repository: modell-aachen/PublishPlugin
Catalog: locale/PublishPlugin/*.po
Languages: de

source: A %1 that will cause a topic to be excluded if the RE matches the topic content.
de: Ein %1, welcher eine Seite ausschließt, wenn der reguläre Ausdruck auf den Seiteninhalt zutrifft.

source: A non-blank =Topic List= is still subject to filtering against =Include filter= and =Exclude filter=.
de: Eine nicht-leere =Seiten Liste= wird weiterhin durch =Einschließende Filter= und =Ausschluss Filter= gefiltert.

source: Advanced topic selection...
de: Erweiterte Seitenauswahl...

source: Attach output options
de: Einstellungen zum Anhängen der Ausgabe

source: By default the plugin uses the default =view= templates when it renders topics for publishing. You can change this to a list of one or more templates that you want to render using.
de: In den Standardeinstellungen benutzt das Plugin das normale =view= template, wenn es die Seiten zur darstellung ausgibt. Sie können das durch eine Liste von einem oder mehreren templates zur Darstellung ersetzen.

source: Choose what to publish
de: Wählen Sie, was publiziert werden soll

source: Comma-separated list of %1 that match the names of topics to exclude. This acts as a filter on the topic list. Leave blank to include all topics in the topic list.
de: Komma-separierte Liste von %1, welche die Namen der auzuschließenden Seiten treffen muss. Diese arbeiten als Filter für die Liste der Seiten. Lassen Sie dieses Feld leer, um alle Seiten einzuschließen.

source: Comma-separated list of %1 that match the names of topics to include. This acts as a filter on the topic list. Use =*= to publish all topics in the list.
de: Komma-separierte Liste von %1, welche die Namen der einzuschließenden Seiten treffen muss. Diese arbeiten als Filter für die Liste der Seiten. Nutzen Sie =*=, um alle Seiten in der Liste zu publizieren.

source: Comma-separated list of Plugins to enable during publishing.
de: Komma-separierte Liste mit Plugins, welche beim Publizieren aktiviert sein sollen.

source: Comma-separated list of template names.
de: Komma-separierte Liste mit template Namen.

source: Comma-separated list of topic names. Leave blank to publish all topics in the web (as filtered by =Include filter= and =Exclude filter=).
de: Komma-separierte Liste mit Seitennamen. Lassen Sie diese Option leer, um alle Seiten in dem Bereich zu publizieren (gefiltert durch =Einschließende Filter= und =Ausschluss Filter=).

source: Consecutive
de: Fortlaufend

source: Copy External Resources
de: Externe Quellen kopieren

source: Copy externally referenced resources (e.g. images on other servers). This option enables the copying of resources hosted on external servers into the published content. If it is disabled, the plugin will maintain an internet link to the external content. Enable this option if you want the pubished content to be totally self-contained (for example, for offline reading) or disable it for faster publishing process and smaller output.
de: Extern referenzierte Quellen kopieren (z.B. Bilder auf anderen Servern). Diese Option ermöglicht es extern liegende Quellen in den publizierten Inhalt zu kopieren. Wenn diese Option deaktiviert ist werden Links auf Quellen im Internet zeigen. Aktivieren Sie diese Option, wenn Sie eine eigenständig abgeschlossene Publikation (z.B. zur offline Betrachtung) brauchen oder deaktivieren Sie die Option aus, um das Publizieren zu beschleunigen und eine kleinere Ausgabe zu erzeugen.

source: Default page (topic)
de: Standard Seite

source: Default processing of topics for publishing tries to render the topics as closely to the way they are viewed in the wiki as possible. These options provide a finer level of control.
de: Standard Verarbeitung von Seiten zum Publizieren; es wird versucht die Seite so nah wie möglich am Erscheinungsbild im Wiki darzustellen. Diese Optionen bieten feinere Kontrollmöglichkeiten.

source: Defaults to the name of the generator
de: Standardwert ist der Name des Generators

source: Directory relative to the root of your site
de: Verzeichnis relativ zur Wurzel der Seite

source: Enable plugins (plugin names)
de: Plugins aktivieren (Plugin namen)

source: Exclude filter
de: Ausschluss filter

source: Extended directory path
de: Erweiterter Verzeichnis-Pfad

source: FTP output options
de: FTP Ausgabe Optionen

source: FTP output options are only relevant if the output format is =ftp=.
de: FTP Ausgabe Optionen sind nur relevant, wenn als Ausgabeformat =ftp= gewählt ist.

source: FTP server password.
de: FTP server Passwort.

source: File output options
de: Datei Ausgabe Optionen

source: File output options are relevant when output is being written to local files on disc.
de: Datei Ausgabe Optionen sind relevant, wenn Ausgabe auf das lokale Dateisystem geschrieben werden.

source: Filter topic contents
de: Filter nach Seiteninhalten

source: For example, you might want to use =viewpdf= to render a PDF version of the topic (if you have this action available). See %1 for a list of the template files available by default.
de: Beispielsweise möchten Sie vielleicht =viewpdf= nutzen um eine PDF Version zu generieren (falls diese Aktion verfügbar ist). Siehe %1 für eine Liste von templates, welche standardmäßig zur Verfügung stehen.

source: Hide currently enabled plugins
de: Momentan aktivierte Plugins ausblenden

source: If a topic does not appear in the table, the most recent version will be published.
de: Wenn eine Seite nicht in der Tabelle vorkommt, wird die neueste Version publiziert.

source: If you leave this field blank then all plugins enabled in the wiki will be run when generating the published output. You are recommended to disable any plugins that generate interactive buttons in the output.
de: Wenn sie dieses Feld leer lassen, werden alle im Wiki aktivierten Plugins beim Erzeugen verwendet. Sie sollten Plugins, welche interaktive Schaltflächen erstellen, ausschalten.

source: Include filter
de: Einschließende Filter

source: Leave blank if you don't need one
de: Leer lassen, wenn nicht benötigt

source: Leave blank to enable all plugins
de: Leer lassen um alle Plugins zu aktivieren

source: Leave blank to include all topics
de: Leer lassen um alle Seiten einzuschließen

source: Leave blank to include all topics in the topic list
de: Leer lassen um alle Seiten aus der Seitenliste einzuschließen

source: Leave blank to publish all topics in the web
de: Leer lassen um alle Seiten aus dem Bereich zu publizieren

source: Leave blank to publish the most recent version of each topic
de: Leer lassen um die neueste Version von jeder Seite zu publizieren

source: Lets you define Foswiki %1 that will be available for use in topics during this publishing run. Define preferences one per line, using the syntax =PREFERENCE=VALUE= - for example,
de: Hier können Sie %1 treffen, welche beim Publizieren genutzt werden. Definieren Sie eine Einstellung pro Zeile mit der Syntax =EINSTELLUNG=WERT= - zum Beispiel:

source: Name of a topic in each published web that contains a table, each row of which maps topic names to the version of that topic to publish.
de: Name einer Seite in jedem zu publizierendem Bereich, welche eine Tabelle enthält, von welcher jede Zeile einen Seitennamen mit der zu publizierenden Version verknüpft.

source: Name of the attachment
de: Name des Anhangs

source: Name of topic to used to generate default.htm, index.html
de: Name der Seite, welche benutzt werden soll um default.hml und index.hmtl zu generieren

source: Note that this list can include topics in other webs, by referring to them using the =Web.TopicName= syntax.
de: Beachten Sie, dass diese Liste Seiten aus anderen Bereichen beinhalten kann, indem sie das =Bereich.Seitename= Format verwendet.

source: Other output generator options
de: Andere Ausgabe-Generator Optionen

source: Output attachment
de: Ausgabe Anhang

source: Output options
de: Ausgabe Optionen

source: Output topic
de: Ausgabe Seite

source: Page numbering
de: Seitenzählung

source: Password
de: Passwort

source: Path of a directory relative to %1 where you want the output generated. '/' means generate the output directly in %2. This allows you to keep different publishings of the same content separated.
de: Pfad zu einem Verzeichnis relativ zu %1 wo die Ausgabe generiert werden soll. '/' bedeutet dass die Ausgabe direkt in %2 generiert werden soll. Dies ermöglicht es verschiedene Publizierungen des selben Inahlts voneinander getrennt zu halten.

source: Path to upload to on the FTP server.
de: Verzeichnis zum Hochladen auf dem FTP server.

source: Publish
de: Publizieren

source: Publish skin
de: Skin zum Publizieren

source: Publishing history topic
de: Seite zur Publizierungs-Historie

source: Resource Directory
de: Quellen Verzeichnis

source: Restart numbering for each topic
de: Auf jeder Wiki-Seite Nummerierung neu starten

source: See %1 for a complete description of where the output is generated.
de: Siehe %1 für eine komplette Beschreibung, wo die Ausgabe erzeugt wird.

source: See %1 for details of where output is created on the server.
de: Siehe %1 für Details, wo die Ausgabe auf dem server erzeugt wird.

source: Server address
de: Server Adresse

source: Set to blank to proof the output prior to uploading to your site.
de: Leer lassen wenn Sie die Ausgabe vor dem Upload prüfen wollen.

source: Show FTP options...
de: FTP Optionen zeigen

source: Show extra options...
de: Extra Optionen zeigen...

source: Show file output options...
de: Dateiausgabe Optionen zeigen...

source: Show processing options...
de: Verarbeitungs Optionen zeigen...

source: Some output generators (e.g. pdf) support extra options.
de: Einge Ausgabe Generatoren (z.B. pdf) unterstüzen extra Optionen.

source: Some output generators support extra options (e.g. for =pdf=, you can add =htmldoc= command-line parameters here, such as =--linkstyle underline=). These options are passed directly to the output generator.
de: Einige Ausgabe Generatoren unterstützen extra Optionen (z.B. für =pdf= können Sie hier für =htmldoc= Kommandozeilen parameter angeben, wie z.B. =--linkstyle underline=). Diese Optionen werden direkt an den Ausgabegenerator weitergegeben.

source: Specify the name of for the attachment.
de: Geben Sie den Namen des Anhangs an.

source: Specify the root of the target output file name.
de: Geben Sie den Dateinamen der Ausgabedatei an (ohne Dateiendung).

source: Specify the topic where the output will be attached.
de: Geben Sie den Seitennamen an, an den die Ausgabe angehangen wird.

source: Speed up the ftp publishing by only uploading modified files. This will store a (tiny) checksum (.md5) file on the server alongside each uploaded file which will be used to optimise future uploads. Recommended.
de: Beschleunigen Sie die Publizierung per FTP, indem Sie nur veränderte Dateien hochladen. Hierdurch wird eine (winzige) Prüfsumme (.md5) zu jeder hochgeladenen Datei auf dem Server gespeichert, welche zur Optimierung zukünftiger Uploads verwendet wird. Empfohlen.

source: The =view= %1 is used to generate published pages, so %2 is the template that will be used to generate the output. You can preview any topic in this skin simply by appending %3 to the end of the view URL. Note that the standard =VIEW_TEMPLATE= template override still works when publishing.
de: Das =view= %1 wird genutzt, um publizierte Seiten zu erzeugen, also ist %2 das template welches genutzt wird um die Ausgabe zu erzeugen. Sie können für jede Seite eine Vorschau generieren, indem Sie %3 an das Ende einer URL anhängen. Beachten Sie, dass das Überschreiben mit =VIEW_TEMPLATE= auch beim Publizieren funktioniert.

source: The Web to publish.
de: Der zu publizierende Bereich.

source: This is required to provide a context for the publishing process (e.g. web preference settings), even if all topics in the =Topic List= have explicit web names.
de: Wird benötigt, um einen Kontext für den Publizierungsprozess (z.B. WebPreferences Einstellungen) herzustellen, selbst wenn alle Seiten in der =Seiten Liste= explizite Bereichsnamen angegeben haben.

source: The available formats are:
de: Die verfügbaren Formate sind:

source: The base URL that your published Foswiki topics will reside at, for instance to create different publishing instances like =dev=, =test= and =public=. Use =/= if you will publish to the root of your site. See also %1.
de: Die base URL zu der sich die publizierten Seiten beziehen, beispielsweise um verschiedene Publizierungen, wie =dev=, =test= und =public=. Nutzen Sie =/= wenn Sie die Wurzel der Seite verwenden wollen. Siehe auch %1.

source: The skin provides the template for how topics are published. See %1 for more informations on skins.
de: Der skin liefert die templates um Seiten zu publizieren. Siehe %1 für weitere Informationen zu skins.

source: The table can be generated by a %1 or other macro. For example: %2.
de: Die Tabelle kann durch eine %1 oder andere Makros generiert werden, z.B. %2.

source: This is where the history of your publishing is stored. Each time you publish, this topic is re-written with the log of the publishing process. You have to have "change" access to this topic. You can specify a topic in another web using the standard Web.Topic syntax.
de: Hier wird die Historie der Publizierungen gespeichert. Bei jeder Publizierung wird diese Seite mit neuen Log-Daten geschrieben. Sie brauchen "change" Zugriff auf diese Seite. Sie können eine Seite in einem anderen Bereich mittels der normalen Bereich.Seite Schreibweise angeben.

source: Topic List
de: Seiten Liste

source: Treat printout as one big topic
de: Ausgabe als eine große Wiki-Seite behandeln

source: Use * to publish all topics in the topic list
de: Nutzen Sie * um alle Seiten aus der Seiten Liste zu publizieren

source: Use basic_publish unless you have your own customised publishing skin
de: Nutzen Sie basic_publish, außer wenn Sie einen angepassten publizierungs skin haben.

source: Use view unless you need a special template
de: Nutzen Sie view, außer wenn Sie ein spezielles template brauchen

source: Versions
de: Versionen

source: View currently enabled plugins
de: Momentan aktivierte Plugins anzeigen

source: Web
de: Bereich

source: When exporting to PDF or TGZ the result will be attached to a topic.
de: Beim Export nach PDF or TGZ wird das Resultat an eine Seite angehangen.

source: When publishing to HTML, attachments, icons, etc, are output to this directory. The directory name is relative to the root of your published site.
de: Beim Publizieren werden HTML, Anhänge, Icons, etc. in dieses Verzeichnis abgelegt. Der Verzeichnisname ist relativ zur Wurzel ihrer publizierten Seite.

source: Where to put the attachment
de: Wohin der Anhang geheftet werden soll

source: You are recommended to pick =basic_publish=, or =plain=, or a =print= skin. Your installation may also offer a special =export= or =publish= skin.
de: Es wird empfohlen =basic_publish= oder =plain= oder eine =print= skin zu verwenden. Ihre Installation bietet vielleicht einen speziellen =export= oder =publish= skin.

source: You can also use the %1 (see %2, below) to build such lists, and include them using the %3 macro.
de: Sie können außerdem %1 (siehe %2, unten) benutzen um solche Listen zu generieren und sie mittels %3 einbinden.

source: You can use Foswiki macros (such as %SEARCH...) in this list - for example, to include the contents of a topic that contains a list of topic names in a bulleted list, use %1.
de: Sie können Foswiki Makros (wie %SEARCH...) in dieser Liste verwenden - beispielsweise um den Inhalt einer Seite mit einer Liste von Seitennamen in einer Aufzählung einzubinden, nutzen Sie %1.

source: preferences
de: Einstellungen

source: regular expression
de: regulärer Ausdruck

source: spaces after the = sign are taken as part of the preference value.
de: Leerzeichen hinter dem = Zeichen werden als Teil des Wertes genutzt.

source: where to find the output
de: wo die Ausgabe gefunden werden kann

source: Processing options
de: Verarbeitungsoptionen

source: Preferences defined this way can be used in topics (including the history topic) like any other Foswiki preference.
de: Auf diese Weise gesetzte Einstellungen können in den Artikeln (auch in der Publizierungs-Historie) genutzt werden, wie alle anderen Foswiki-Einstellungen auch.

source: Advanced informations...
de: Weiterführende Informationen...

source: Choose how the page numbering of multiple topics is being handled.
de: Hier können Sie einstellen auf welche Weise die Seitennummerierung auf verschiedene Wiki-Seiten übertragen wird.
